{"batchcomplete":"","query":{"pages":{"51425":{"pageid":51425,"ns":0,"title":"Somaliland","extract":"Somaliland, officially the Republic of Somaliland, is an unrecognised country in the Horn of Africa. It is located in the southern coast of the Gulf of Aden and bordered by Djibouti to the northwest, Ethiopia to the south and west, and Somalia to the east. Its claimed territory has an area of 176,120 square kilometres (68,000 sq mi), with approximately 6.2 million people as of 2024. The capital and largest city is Hargeisa.
Various Somali Muslim kingdoms were established in the area during the early Islamic period, including in the 14th to 15th centuries the Zeila-based Adal Sultanate. In the early modern period, successor states to the Adal Sultanate emerged, including the Isaaq Sultanate which was established in the middle of the 18th century. In the late 19th century, the United Kingdom signed agreements with various clans in the area, establishing the Somaliland Protectorate, which was formally granted independence by the United Kingdom as the State of Somaliland on 26 June 1960. Five days later, the State of Somaliland voluntarily united with the Trust Territory of Somalia (the former Italian Somalia) to form the Somali Republic. The union of the two states proved problematic early on, and in response to the harsh policies enacted by Somalia's Barre regime against the main clan family in Somaliland, the Isaaq, shortly after the conclusion of the disastrous Ogaden War, a 10-year war of independence concluded with the declaration of Somaliland's independence in 1991. The Government of Somaliland regards itself as the successor state to British Somaliland.
Since 1991, the territory has been governed by democratically elected governments that seek international recognition as the government of the Republic of Somaliland. The central government maintains informal ties with some foreign governments, who have sent delegations to Hargeisa; Somaliland hosts representative offices from several countries, including Ethiopia and Taiwan. However, Somaliland's self-proclaimed independence has not been officially recognised by any UN member state or international organisation. It is the largest unrecognised state in the world by de facto controlled land area. It is a member of the Unrepresented Nations and Peoples Organization, an advocacy group whose members consist of indigenous peoples, minorities and unrecognised or occupied territories. Following the Las Anod conflict that emerged in 2022, Somaliland lost control of a significant portion of its eastern territory to pro-unionist forces who established the SSC-Khatumo administration.


== Etymology ==

The name Somaliland is derived from two words: "Somali" and "land". The area was named when Britain took control from the Egyptian administration in 1884, after signing successive treaties with the ruling Somali Sultans from the Isaaq, Issa, Gadabursi, and Warsangali clans. The British established a protectorate in the region referred to as British Somaliland. In 1960, when the protectorate became independent from Britain, it was called the State of Somaliland. Five days later, on 1 July 1960, Somaliland united with the  Trust Territory of Somaliland under Italian Administration (the former Italian Somaliland). The name "Republic of Somaliland" was adopted upon the declaration of independence following the Somali Civil War in 1991.
At the Grand conference in Burao held in 1991, many names for the country were suggested, including Puntland, in reference to Somaliland's location in the ancient Land of Punt and which is now the name of the Puntland state in neighbouring Somalia, and Shankaroon, meaning "better than five" in Somali, in reference to the five regions of Greater Somalia.


== History ==


=== Prehistory ===

The area of Somaliland was inhabited around 10,000 years ago during the Neolithic age. The ancient shepherds raised cows and other livestock and created vibrant rock art paintings. During the Stone Age, the Doian and Hargeisan cultures flourished here. The oldest evidence of burial customs in the Horn of Africa comes from cemeteries in Somaliland dating back to the 4th millennium BCE. The stone implements from the Jalelo site in the north were also characterised in 1909 as important artefacts demonstrating the archaeological universality during the Paleolithic between the East and the West.
According to linguists, the first Afroasiatic-speaking populations arrived in the region during the ensuing Neolithic period from the family's proposed urheimat ("original homeland") in the Nile Valley, or the Near East.
The Laas Geel complex on the outskirts of Hargeisa dates back around 5,000 years, and has rock art depicting both wild animals and decorated cows. Other cave paintings are found in the northern Dhambalin region, which feature one of the earliest known depictions of a hunter on horseback. The rock art is in the distinctive Ethiopian-Arabian style, dated to 1,000 to 3,000 BCE. Additionally, between the towns of Las Khorey and El Ayo in eastern Somaliland lies Karinhegane, the site of numerous cave paintings of real and mythical animals. Each painting has an inscription below it, which collectively have been estimated to be around 2,500 years old.


=== Antiquity and classical era ===

Ancient pyramidical structures, mausoleums, ruined cities and stone walls, such as the Wargaade Wall, are evidence of civilisations thriving in the Somali peninsula. Ancient Somaliland had a trading relationship with ancient Egypt and Mycenaean Greece dating back to at least the second millennium BCE, supporting the hypothesis that Somalia or adjacent regions were the location of the ancient Land of Punt. The Puntites traded myrrh, spices, gold, ebony, short-horned cattle, ivory and frankincense with the Egyptians, Phoenicians, Babylonians, Indians, Chinese and Romans through their commercial ports. An Egyptian expedition sent to Punt by the 18th dynasty Queen Hatshepsut is recorded on the temple reliefs at Deir el-Bahari, during the reign of the Puntite King Parahu and Queen Ati. In 2015, isotopic analysis of ancient baboon mummies from Punt that had been brought to Egypt as gifts indicated that the specimens likely originated from an area encompassing eastern Somalia and the Eritrea-Ethiopia corridor.
The camel is believed to have been domesticated in the Horn region sometime between the 2nd and 3rd millennium BCE. From there, it spread to Egypt and the Maghreb. During the classical period, the northern Barbara city-states of Mosylon, Opone, Mundus, Isis, Malao, Avalites, Essina, Nikon, and Sarapion developed a lucrative trade network, connecting with merchants from Ptolemaic Egypt, Ancient Greece, Phoenicia, Parthian Persia, Saba, the Nabataean Kingdom, and the Roman Empire. They used the ancient Somali maritime vessel known as the beden to transport their cargo.
After the Roman conquest of the Nabataean Empire and the establishment of a Roman naval presence at Aden to curb piracy, Arab and Somali merchants cooperated with the Romans to bar Indian ships from trading in the free port cities of the Arabian peninsula to protect the interests of Somali and Arab merchants in the lucrative commerce between the Red and Mediterranean Seas. However, Indian merchants continued to trade in the port cities of the Somali peninsula, which was free from Roman interference.
For centuries, Indian merchants brought large quantities of cinnamon to Somalia and Arabia from Ceylon and the Spice Islands. The source of the spices is said to have been the best-kept secret of Arab and Somali merchants in their trade with the Roman and Greek world; the Romans and Greeks believed the source to have been the Somali peninsula. The collaboration between Somali and Arab traders inflated the price of Indian and Chinese cinnamon in North Africa, the Near East, and Europe, and made the spice trade profitable, especially for the Somali merchants through whose hands large quantities were shipped across sea and land routes.
In 2007, more rock art sites with Sabaean and Himyarite writings in and around Hargeisa were found, but some were bulldozed by developers.


=== Birth of Islam and the Middle Ages ===

The Isaaq people traditionally claim to have descended from Sheikh Ishaaq bin Ahmed, an Islamic scholar who purportedly traveled to Somaliland in the 12th or 13th century and married two women; one from the local Dir clan and the other from the neighboring Harari people. He is said to have sired eight sons who are the common ancestors of the clans of the Isaaq clan-family. He remained in Maydh until his death.
As the Isaaq clan-family grew in size and numbers during the 12th century, the clan-family migrated and spread from their core area in Mait (Maydh) and the wider Sanaag region in a southwestward expansion over a wide portion of present-day Somaliland by the 15th and 16th centuries. As the Isaaq expanded the earlier Dir communities of Mait and the wider Sanaag region were driven westwards and to the south towards their present positions. In this general expansion the Isaaq split up into their present component segments, however one fraction of the Habar Yunis clan, the Muse 'Arre, remains behind in Mait as the custodians of the tomb of Sheikh Ishaaq. By the 1300s the Isaaq clans united to defend their inhabited territories and resources during clan conflicts against migrating clans.
After the war, the Isaaq clans (along with other tribes like the Daarood) grew in numbers and territory in the northeast, causing them to began to vie with their Oromo neighbours, who were expanding northwards themselves after the Great Oromo Migrations, thus creating a general thrust toward the southwest. The Isaaq, along with Darood subclans pushed westwards into the plains of Jigjiga and further, beyond where they played a important role in the Adal Sultanate's campaigns against Christian Abyssinia. By the 16th to 17th century the movements that followed seem to have established the Isaaqs on coastal Somaliland.
Various Somali Muslim kingdoms were established in the area in the early Islamic period. In the 14th century, the Zeila-based Adal Sultanate battled the forces of the Ethiopian emperor Amda Seyon I. The Ottoman Empire later occupied Berbera and environs in the 1500s. Muhammad Ali, Pasha of Egypt, subsequently established a foothold in the area between 1821 and 1841.
The Sanaag region is home to the ruined Islamic city of Maduna near El Afweyn, which is considered the most substantial and accessible ruin of its type in Somaliland. The main feature of the ruined city is a large rectangular mosque, its 3-metre high walls still standing, which include a mihrab and possibly several smaller arched niches. Swedish-Somali archaeologist Sada Mire dates the ruined city to the 15th–17th centuries.


=== Early modern sultanates ===


==== Isaaq Sultanate ====
In the early modern period, successor states to the Adal Sultanate began to flourish in Somaliland. These included the Isaaq Sultanate and Habr Yunis Sultanate. The Isaaq Sultanate was a Somali kingdom that ruled parts of the Horn of Africa during the 18th and 19th centuries. It spanned the territories of the Isaaq clan, descendants of the Banu Hashim clan, in modern-day Somaliland and Ethiopia. The sultanate was governed by the Rer Guled branch established by the first sultan, Sultan Guled Abdi, of the Eidagale clan. The sultanate is the pre-colonial predecessor to the modern Republic of Somaliland.
According to oral tradition, prior to the Guled dynasty the Isaaq clan-family were ruled by a dynasty of the Tolje'lo branch descending from Ahmed nicknamed Tol Je'lo, the eldest son of Sheikh Ishaaq's Harari wife. There were eight Tolje'lo rulers in total, starting with Boqor Harun (Somali: Boqor Haaruun) who ruled the Isaaq Sultanate for centuries starting from the 13th century. The last Tolje'lo ruler Garad Dhuh Barar (Somali: Dhuux Baraar) was overthrown by a coalition of Isaaq clans. The once strong Tolje'lo clan were scattered and took refuge among the Habr Awal with whom they still mostly live.
The Sultan of Isaaq regularly convened shirs (meetings) where he would be informed and advised by leading elders or religious figures on what decisions to make. In the case of the Dervish movement, Sultan Deria Hassan had chosen not to join after receiving counsel from Sheikh Madar. He addressed early tensions between the Saad Musa and Eidagale upon the former's settlement into the growing town of Hargeisa in the late 19th century. The Sultan was also responsible for organising grazing rights and, in the late 19th century, new agricultural spaces. The allocation of resources and sustainable use of them was also a matter that Sultans concerned themselves with and was crucial in this arid region. In the 1870s, at a famous meeting between Sheikh Madar and Sultan Deria, it was proclaimed that hunting and tree cutting in the vicinity of Hargeisa would be banned, and that the holy relics from Aw Barkhadle would be brought and oaths would be sworn on them by the Isaaqs in the presence of the Sultan whenever internal combat broke out.
Aside from the leading Sultan of Isaaq there were numerous Akils, Garaads and subordinate Sultans alongside religious authorities that constituted the Sultanate; occasionally these would declare their independence or simply break from its authority.
The Isaaq Sultanate had 5 rulers prior to the creation of British Somaliland in 1884. Historically, Sultans would be chosen by a committee of several important members of the various Isaaq subclans. Sultans were usually buried at Toon, south of Hargeisa, which was a significant site and the capital of the Sultanate during Farah Guled's rule.


==== Battle of Berbera ====

The first engagement between Somalis of the region and the British was in 1825 and led to hostilities, ending in the Battle of Berbera and a subsequent trade agreement between the Habr Awal and the United Kingdom. This was followed by a British treaty with the Governor of Zeila in 1840. An engagement was then started between the British and elders of Habar Garhajis and Habar Toljaala clans of the Isaaq in 1855, followed a year later by the conclusion of the "Articles of Peace and Friendship" between the Habar Awal and East India Company. These engagements between the British and Somali clans culminated in the formal treaties the British signed with the henceforth 'British Somaliland' clans, which took place between 1884 and 1886 (treaties were signed with the Habar Awal, Gadabursi, Habar Toljaala, Habar Garhajis, Esa, and the Warsangali clans), and paved the way for the British to establish a protectorate in the region referred to as British Somaliland. The British garrisoned the protectorate from Aden and administered it as part of British India until 1898. British Somaliland was then administered by the Foreign Office until 1905, and afterwards by the Colonial Office.


=== British Somaliland ===

The Somaliland Campaign, also called the Anglo-Somali War or the Dervish War, was a series of military expeditions that took place between 1900 and 1920 in the Horn of Africa, pitting the Dervishes led by Mohammed Abdullah Hassan (nicknamed the "Mad Mullah") against the British. The British were assisted in their offensives by the Ethiopians and Italians. During the First World War (1914–1918), Hassan also received aid from the Ottomans, Germans and, for a time, from the Emperor Iyasu V of Ethiopia. The conflict ended when the British aerially bombed the Dervish capital of Taleh in February 1920.
The Fifth Expedition of the Somaliland campaign in 1920 was the final British expedition against the Dervish forces of Mohammed Abdullah Hassan, the Somali religious leader. Although most of the combat took place in January of the year, British troops had begun preparations for the assault as early as November 1919. The British forces included elements of the Royal Air Force and the Somaliland Camel Corps. After three weeks of battle, Hassan's Dervishes were defeated, bringing an effective end to their 20-year resistance. It was one of the bloodiest and longest militant movements in sub-Saharan Africa during the colonial era, one that overlapped with World War I. The battles between various sides over two decades killed nearly a third of Somaliland's population and ravaged the local economy.
The Italian conquest of British Somaliland was a military campaign in East Africa, which took place in August 1940 between forces of Italy and those of several British and Commonwealth countries. The Italian attack was part of the East African campaign.


=== Anti-colonial resistance ===


==== Burao Tax Revolt and RAF bombing ====

The people of Burao clashed with the British in 1922. They revolted in opposition to a new tax that was imposed upon them, rioting and attacking British government officials. This led to a shootout between the British and Burao residents in which Captain Allan Gibb, a Dervish war veteran and district commissioner, was shot and killed. The British requested Sir Winston Churchill, then Secretary of State for the Colonies, to send troops from Aden and Air Force bombers Burao the revolting clans' livestock. The RAF planes arrived at Burao within two days and proceeded to bomb the town with incendiaries, effectively burning the entire settlement to the ground.
Telegram from Sir Geoffrey Archer, Governor of British Somaliland to Sir Winston Churchill the Secretary of State for the Colonies:

I deeply regret to inform that during an affray at Burao yesterday between Rer Sugulleh and Akils of other tribes Captain Gibb was shot dead. Having called out Camel corps company to quell the disturbance, he went forward himself with his interpreter, whereupon fire opened on him by some Rer segulleh riflemen and he was instantly killed..Miscreants then disappeared under the cover of darkness.
To meet the situation created by the Murder of Gibb, we require two aeroplanes for about fourteen days. I have arranged with resident, Aden, for these. And made formal application, which please confirm. It is proposed they fly via Perim, confining sea crossing to 12 miles. We propose to inflict fine of 2,500 camels on implicated sections, who are practically isolated and demand surrender of man who killed Gibbs. He is known. Fine to be doubled in failure to comply with latter conditions and aeroplanes to be used to bomb stock on grazing grounds.
Sir Winston Churchill reporting on the Burao incident at the House of Commons:

On 25th February the Governor of Somaliland telegraphed that an affray between tribesmen had taken place at Burao on the previous day, in the course of which Captain Allan Gibb, D.S.O., D.C.M., the District Commissioner at Burao, had been shot dead. Captain Gibb had advanced with his interpreter to quell the disturbance, when 1954 fire was opened upon him by some riflemen, and he was instantly killed. The murderers escaped under cover of falling darkness.
Captain Gibb was an officer of long and valued service in Somaliland, whose loss I deeply regret. From the information available, his murder does not appear to have been premeditated, but it inevitably had a disturbing effect upon the surrounding tribes, and immediate dispositions of troops became necessary to ensure the apprehension and punishment of those responsible for the murder. On 27th February the Governor telegraphed that, to meet the situation which had arisen, he required two aeroplanes for purposes of demonstration, and suggested that two aeroplanes from the Royal Air Force Detachment at Aden should fly over to Berber a from Aden. He also telegraphed that in certain circumstances it might become necessary to ask for reinforcements of troops to be sent to the Protectorate.
James Lawrence author of Imperial Rearguard: Wars of Empire writes

[Gibb]..was murdered by rioters during a protest against taxation at Burao. Governor Archer immediately called for aircraft which were at Burao within two days. The inhabitants of the native township were turned out of their houses, and the entire area was razed by a combination of bombing, machine-gun fire and burning.
After the RAF aircraft bombed Burao to the ground, the leaders of the rebellion acquiesced, agreeing to pay a fine for Gibb's death, but they refused to identify and apprehend the accused individuals. Most of the men responsible for Gibb's shooting evaded capture. In light of the failure to implement the taxation without provoking a violent response, the British abandoned the policy altogether.


==== 1945 Sheikh Bashir Rebellion ====

The 1945 Sheikh Bashir Rebellion was a rebellion waged by tribesmen of the Habr Je'lo clan in the former British Somaliland protectorate against British authorities in July 1945 led by Sheikh Bashir, a Somali religious leader.
On 2 July, Sheikh Bashir collected 25 of his followers in the town of Wadamago and transported them on a lorry to the vicinity of Burao, where he distributed arms to half of his followers. On the evening of 3 July, the group entered Burao and opened fire on the police guard of the central prison in the city, which was filled with prisoners arrested for previous demonstrations. The group also attacked the house of the district commissioner of Burao District, Major Chambers, resulting in the death of Major Chamber's police guard before escaping to Bur Dhab, a strategic mountain south-east of Burao, where Sheikh Bashir's small unit occupied a fort and took up a defensive position in anticipation of a British counterattack.
The British campaign against Sheikh Bashir's troops proved abortive after several defeats as his forces kept moving from place to place and avoiding any permanent location. No sooner had the expedition left the area, than the news travelled fast among the Somali nomads across the plain. The war had exposed the British administration to humiliation. The government came to a conclusion that another expedition against him would be useless; that they must build a railway, make roads and effectively occupy the whole of the protectorate, or else abandon the interior completely. The latter course was decided upon, and during the first months of 1945, the advance posts were withdrawn, and the British administration confined to the coast town of Berbera.
Sheikh Bashir settled many disputes among the tribes in the vicinity, which kept them from raiding each other. He was generally thought to settle disputes through the use of Islamic Sharia and gathered around him a strong following.
The British administration recruited Indian and South African troops, led by police general James David, to fight against Sheikh Bashir and had intelligence plans to capture him alive. The British authorities mobilised a police force, and eventually on 7 July found Sheikh Bashir and his unit in defensive positions behind their fortifications in the mountains of Bur Dhab. After clashes Sheikh Bashir and his second-in-command, Alin Yusuf Ali, nicknamed Qaybdiid, were killed. A third rebel was wounded and was captured along with two other rebels. The rest fled the fortifications and dispersed. On the British side the police general leading the British troops as well as a number of Indian and South African troops perished in the clashes, and a policeman was injured.
After his death, Sheikh Bashir was widely hailed by locals as a martyr and was held in great reverence. His family took quick action to remove his body from the place of his death at Geela-eeg mountain, about 20 miles from Burao.


=== State of Somaliland (Independence) ===

Initially the British government planned to delay protectorate of British Somaliland independence in favour of a gradual transfer of power. The arrangement would allow local politicians to gain more political experience in running the protectorate before official independence. However, strong pan-Somali nationalism and a landslide victory in the earlier elections encouraged them to demand independence and unification with the  Trust Territory of Somaliland under Italian Administration (the former Italian Somaliland).
In May 1960, the British government stated that it would be prepared to grant independence to the then protectorate of British Somaliland, with the intention that the territory would unite with the Italian-administered Trust Territory of Somaliland. The Legislative Council of British Somaliland passed a resolution in April 1960 requesting independence and union with the Trust Territory of Somaliland, which was scheduled to gain independence on 1 July that year. The legislative councils of both territories agreed to this proposal following a joint conference in Mogadishu.
On 26 June 1960, the former British Somaliland protectorate briefly obtained independence as the State of Somaliland, with the Trust Territory of Somaliland following suit five days later. During its brief period of independence, the State of Somaliland garnered recognition from thirty-five sovereign states. However, the United States merely acknowledged Somaliland's independence:

The United States did not extend formal recognition to Somaliland, but Secretary of State Herter sent a congratulatory message dated June 26 to the Somaliland Council of Ministers.
The following day, on 27 June 1960, the newly convened Somaliland Legislative Assembly approved a bill that would formally allow for the union of the State of Somaliland with the Trust Territory of Somaliland on 1 July 1960.


=== Somali Republic (union with Somalia) ===

On 1 July 1960, the State of Somaliland and the Trust Territory of Somaliland (the former Italian Somaliland) united as planned to form the Somali Republic. Inspired by Somali nationalism, the northerners were initially enthusiastic about the union. A government was formed by Abdullahi Issa, with Aden Abdullah Osman Daar as President and Abdirashid Ali Shermarke as Prime Minister (later becoming president, from 1967 to 1969). On 20 July 1961 and through a popular referendum, the Somali people ratified a new constitution, which was first drafted in 1960. The constitution had little support in the former Somaliland and was believed to favour the south. Many northerners boycotted the referendum in protest, and over 60% of those who voted in the north were against the new constitution. Regardless, the referendum passed, and Somaliland became quickly dominated by southerners. As result, dissatisfaction became widespread in the north, and support for the union plummeted. British-trained Somaliland officers attempted a revolt to end the union in December 1961. Their uprising failed, and Somaliland continued to be marginalised by the south during the next decades.
In 1967, Muhammad Haji Ibrahim Egal became Prime Minister, a position to which he was appointed by Shermarke. Shermarke was assassinated two years later by one of his own bodyguards. His murder was quickly followed by a military coup d'état on 21 October 1969 (the day after his funeral), in which the Somalian Army seized power without encountering armed opposition. The putsch was spearheaded by Major General Mohamed Siad Barre, who at the time commanded the army. The new regime would go on to rule Somalia for the next 22 years.


=== Somali National Movement, Barre persecution ===

The moral authority of Barre's government was gradually eroded, as many Somalis became disillusioned with life under military rule. By the mid-1980s, resistance movements supported by Ethiopia's communist Derg administration had sprung up across the country, which led to the Somaliland War of Independence. Barre responded by ordering punitive measures against those he perceived as locally supporting the guerrillas, especially in the northern regions. The clampdown included bombing of cities, with the northwestern administrative centre of Hargeisa, a Somali National Movement (SNM) stronghold, among the targeted areas in 1988. The bombardment was led by General Mohammed Said Hersi Morgan, Barre's son-in-law.
In May 1988, the SNM launched a major offensive on the cities of Hargeisa and Burao, then the second and third largest cities of Somalia. The SNM captured Burao on 27 May within two hours, while the SNM entered Hargeisa on 29 May, overrunning most of the city apart from its airport by 1 June.
According to Abou Jeng and other scholars, the Barre regime rule was marked by a targeted brutal persecution of the Isaaq clan. Mohamed Haji Ingiriis and Chris Mullin state that the clampdown by the Barre regime against the Hargeisa-based Somali National Movement targeted the Isaaq clan, to which most members of the SNM belonged. They refer to the clampdown as the Isaaq Genocide or "Hargeisa Holocaust". A United Nations investigation concluded that the crime of genocide was conceived, planned and perpetrated by the Somali Government against the Isaaq people. The number of civilian casualties is estimated to be between 50,000 and 100,000 according to various sources, while some reports estimate the total civilian deaths to be upwards of 200,000 Isaaq civilians. Along with the deaths, Barre regime bombarded and razed the second and third largest cities in Somalia, Hargeisa and Burao, respectively. This displaced an estimated 400,000 local residents to Hart Sheik in Ethiopia; another 400,000 individuals were also internally displaced.
The counterinsurgency by the Barre regime against the SNM targeted the rebel group's civilian base of support, escalating into a genocidal onslaught against the Isaaq clan. This led to anarchy and violent campaigns by fragmented militias, which then wrested power at a local level. The Barre regime's persecution was not limited to the Isaaq, as it targeted other clans such as the Hawiye. The Barre regime collapsed in January 1991. Thereafter, as the political situation in Somaliland stabilised, the displaced people returned to their homes, the militias were demobilised or incorporated into the army, and tens of thousands of houses and businesses were reconstructed from rubble.


=== Restoration of sovereignty (end of the unity with Somalia) ===

Although the SNM at its inception had a unionist constitution, it eventually began to pursue independence, looking to secede from the rest of Somalia. Under the leadership of Abdirahman Ahmed Ali Tuur, the local administration declared the northwestern Somali territories independent at a conference held in Burao between 27 April 1991 and 15 May 1991. Tuur then became the newly established Somaliland polity's first President, but subsequently renounced the separatist platform in 1994 and began instead to publicly seek and advocate reconciliation with the rest of Somalia under a power-sharing federal system of governance. A brief armed conflict had begun in January 1992 against rebels against Tuur in the period that he was in power, lasting until August 1992, when it was settled by a conference at the town of Sheikh.
Muhammad Haji Ibrahim Egal was appointed as Tuur's successor in 1993 by the Grand Conference of National Reconciliation in Borama, which met for four months, leading to a gradual improvement in security, as well as a consolidation of the new territory. Another armed conflict between the Somaliland government, now under Egal, and rebels began, as militias of the Eidagalley clan occupied Hargeisa airport for some time. Conflict re-erupted when troops of the government attacked the airport to drive out the Eidagalley militias in October 1994, sparking a new war that would spread out of Hargeisa and last until around April 1995, with a rebel defeat. Around the same time, Djiboutian-backed forces of the Issa-dominated United Somali Front attempted and failed to carve out Issa-inhabited areas of Somaliland. Egal was reappointed in 1997, and remained in power until his death on 3 May 2002. The vice-president, Dahir Riyale Kahin, who was during the 1980s the highest-ranking National Security Service (NSS) officer in Berbera in Siad Barre's government, was sworn in as president shortly afterward. In 2003, Kahin became the first elected president of Somaliland.
The war in southern Somalia between Islamist insurgents on the one hand, and the Federal Government of Somalia and its African Union allies on the other, has for the most part not directly affected Somaliland, which, like neighbouring Puntland, has remained relatively stable.


=== 2001 constitutional referendum ===

In August 2000, Egal's government distributed thousands of copies of the proposed constitution throughout Somaliland for consideration and review by the people. One critical clause of the 130 individual articles of the constitution would ratify Somaliland's self-declared independence and final separation from Somalia, restoring the nation's independence for the first time since 1960. In late March 2001, Egal set the date for the referendum on the Constitution for 31 May 2001. 99.9% of eligible voters took part in the referendum and 97.1% of them voted in favour of the constitution.


=== 2023 Las Anod conflict ===

On 6 February 2023, the Dhulbahante clan elders of Las Anod declared their intent to secede from Somaliland and form a state government named "SSC-Khatumo" within the Federal Government of Somalia, triggering armed conflict.
During November 2024, Abdirahman Mohamed Abdullahi 'Irro' won the Somaliland presidential election.


== Government and politics ==


=== Constitution ===
The Constitution of Somaliland defines the political system; the Republic of Somaliland is a unitary state and Presidential Republic, based on peace, co-operation, democracy and a multi-party system.


=== President and cabinet ===

The executive is led by an elected president, whose government includes a vice-president and a Council of Ministers. The Council of Ministers, who are responsible for the normal running of government, are nominated by the President and approved by the Parliament's House of Representatives. The President must approve bills passed by the Parliament before they come into effect. Presidential elections are confirmed by the National Electoral Commission of Somaliland. The President can serve a maximum of two five-year terms. The official residence and administrative headquarters of the President is the Somaliland Presidential Palace or State House in the capital city of Hargeisa.


=== Parliament ===

Legislative power is held by the Parliament, which is bicameral. Its upper house is the House of Elders, chaired by Suleiman Mohamoud Adan, and the lower house is the House of Representatives, chaired by Yasin Haji Mohamoud. Each house has 82 members. Members of the House of Elders are elected indirectly by local communities for six-year terms. The House of Elders shares power in passing laws with the House of Representatives, and also has the role of solving internal conflicts, and exclusive power to extend the terms of the President and representatives under circumstances that make an election impossible. Members of the House of Representatives are directly elected by the people for five-year terms. The House of Representatives shares voting power with the House of Elders, though it can pass a law that the House of Elders rejects if it votes for the law by a two-thirds majority and has absolute power in financial matters and confirmation of Presidential appointments (except for the Chief Justice of the Supreme Court).


=== Law ===

The judicial system is divided into district courts (which deal with matters of family law and succession, lawsuits for amounts up to 3 million SLSH, criminal cases punishable by up to 3 years' imprisonment or 3 million SL fines, and crimes committed by juveniles), regional courts (which deal with lawsuits and criminal cases not within the jurisdiction of district courts, labour and employment claims, and local government elections), regional appeals courts (which deal with all appeals from the district and regional courts), and the Supreme court (which deals with issues between courts and in government, and reviews its own decisions), which is the highest court and also functions as the Constitutional Court.
Somaliland nationality law defines who is a Somaliland citizen, as well as the procedures by which one may be naturalised into Somaliland citizenship or renounce it.
The Somaliland government continues to apply the 1962 penal code of the Somali Republic. As such, homosexual acts are illegal in the territory.


=== Parties and elections ===

The guurti worked with rebel leaders to set up a new government, and was incorporated into the governance structure, becoming the Parliament's House of Elders. The government became in essence a power-sharing coalition of Somaliland's main clans, with seats in the Upper and Lower houses proportionally allocated to clans according to a predetermined formula, although not all clans are satisfied with their representation. In 2002, after several extensions of this interim government, Somaliland transitioned to multi-party democracy. The election was limited to three parties, in an attempt to create ideology-based elections rather than clan-based elections. As of December 2014, Somaliland has three political parties: the Peace, Unity, and Development Party, the Justice and Development Party, and Wadani. Under the Somaliland Constitution, a maximum of three political parties at the national level is allowed. The minimum age required to vote is 15.
Freedom House ranks the Somaliland government as partly free. Seth Kaplan (2011) argues that in contrast to southern Somalia and adjacent territories, Somaliland, the secessionist northwestern portion of Somalia, has built a more democratic mode of governance from the bottom up, with virtually no foreign assistance. Specifically, Kaplan suggests that Somaliland has the most democratic political system in the Horn of Africa because it has been largely insulated from the extremist elements in the rest of Somalia and has viable electoral and legislative systems as well as a robust private sector-dominated economy, unlike neighbouring authoritarian governments. He largely attributes this to Somaliland's integration of customary laws and tradition with modern state structures, which he indicates most post-colonial states in Africa and the Middle East have not had the opportunity to do. Kaplan asserts that this has facilitated cohesiveness and conferred greater governmental legitimacy in Somaliland, as has the territory's comparatively homogeneous population, relatively equitable income distribution, a common fear of the south, and absence of interference by outside forces, which has obliged local politicians to observe a degree of accountability.


=== Foreign relations ===

Somaliland has political contacts with its neighbours Ethiopia and Djibouti, non-UN member state Republic of China (Taiwan), as well as with South Africa, Sweden, and the United Kingdom. On 17 January 2007, the European Union (EU) sent a delegation for foreign affairs to discuss future co-operation. The African Union (AU) has also sent a foreign minister to discuss the future of international acknowledgment, and on 29 and 30 January 2007, the ministers stated that they would discuss acknowledgement with the organisation's member states.
In early 2006, the National Assembly for Wales extended an official invitation to the Somaliland government to attend the royal opening of the Senedd building in Cardiff. The move was seen as an act of recognition by the Welsh Assembly of the breakaway government's legitimacy. The Foreign and Commonwealth Office made no comment on the invitation. Wales is home to a significant Somali expatriate community from Somaliland.
In 2007, a delegation led by President Kahin was present at the Commonwealth Heads of Government Meeting in Kampala, Uganda. Although Somaliland has applied to join the Commonwealth under observer status, its application is still pending.
On 24 September 2010, Johnnie Carson, Assistant Secretary of State for African Affairs, stated that the United States would be modifying its strategy in Somalia and would seek deeper engagement with the governments of Somaliland and Puntland while continuing to support the Somali Transitional Government. Carson said the US would send aid workers and diplomats to Puntland and Somaliland and alluded to the possibility of future development projects. However, Carson emphasised that the US would not extend formal recognition to either region.

The then-UK Minister for Africa, Henry Bellingham MP, met President Silanyo of Somaliland in November 2010 to discuss ways in which to increase the UK's engagement with Somaliland. President Silanyo said during his visit to London: We have been working with the international community and the international community has been engaging with us, giving us assistance and working with us in our democratisation and development programmes. And we are very happy with the way the international community has been dealing with us, particularly the UK, the US, other European nations, and our neighbours who continue to seek recognition.
Recognition of Somaliland by the UK was also supported by the UK Independence Party, which came third in the popular vote at the 2015 general election, though only electing a single MP. The leader of UKIP, Nigel Farage, met with Ali Aden Awale, Head of the Somaliland UK Mission on Somaliland's national day, 18 May, in 2015, to express UKIP's support for Somaliland.
In 2011, Somaliland and the neighbouring Puntland region each entered a security-related memorandum of understanding with the Seychelles. Following the framework of an earlier agreement signed between the Transitional Federal Government and Seychelles, the memorandum is for the transfer of convicted persons to prisons in 'Puntland' and 'Somaliland'.
On 1 July 2020, Somaliland and Taiwan signed an agreement to set up representative offices to promote cooperation between the two countries. Cooperation between the two polities on education, maritime security, and medicine began in 2009, and Taiwanese staff entered Somaliland in February 2020 to prepare for the representative office. As of 2023, Taiwan's Ministry of Foreign Affairs refers to Somaliland as a country.
On 1 January 2024, a memorandum of understanding was signed between Ethiopia and Somaliland, where Ethiopia will lease the port of Berbera on the Gulf of Aden, and a 20-kilometre stretch of Gulf of Aden coastline, for 20 years, in exchange for eventual recognition of Somaliland as an independent state and a stake in the Ethiopian Airlines. If this agreement is honoured, Ethiopia would become the first United Nations member state to recognise the breakaway nation.


==== Border disputes ====

Somaliland continues to claim the entire area of the former British Somaliland which gained independence in 1960 in the name of State of Somaliland. It is currently in control of the vast majority of the former State of Somaliland.
Puntland, a federal member state of Somalia, disputes the Harti-inhabited territory in the former British Somaliland protectorate based on kinship. In 1998, the northern Darod clans established the state, and the Dhulbahante and Warsangali clans wholly participated in its foundation.
The Harti were the second most powerful clan confederation in Somaliland until the 1993 Borama Conference, when they were replaced in importance by the Gadabursi. The Dhulbahante and Warsangali clans established two separate administrations in the early 1990s. First, the former was to hold the Boocame I conference in May 1993, while the later held a conference in Hadaaftimo in September 1992. In both conferences the desire to remain part of Somalia was expressed.
Tensions between Puntland and Somaliland escalated into violence several times between 2002 and 2009. In October 2004, and again in April and October 2007, armed forces of Somaliland and Puntland clashed near the town of Las Anod, the capital of Sool region. In October 2007, Somaliland troops took control of the town. While celebrating Puntland's 11th anniversary on 2 August 2009, Puntland officials vowed to recapture Las Anod. While Somaliland claims independent statehood and therefore "split up" the "old" Somalia, Puntland works for the re-establishment of a united but federal Somali state.
Somaliland forces took control of the town of Las Qorey in eastern Sanaag on 10 July 2008, along with positions 5 km (3 mi) east of the town. The defence forces completed their operations on 9 July 2008 after the Maakhir and Puntland militia in the area left their positions.
In the late 2000s, SSC Movement (Hoggaanka Badbaadada iyo Mideynta SSC), a local unionist group based in Sanaag was formed with the goal to establish its own regional administration (Sool, Sanaag and Cayn, or SSC). This later evolved into Khatumo State, which was established in 2012. The local administration and its constituents does not recognise the Somaliland government's claim to sovereignty or to its territory.
On 20 October 2017 in Aynabo, an agreement was signed with the Somaliland government which stipulated the amendment of Somaliland's constitution and to integrate the organisation into the Somaliland government. This signalled the end of the organisation even though it was an unpopular event among the Dhulbahante community.


=== Military ===

The Somaliland Armed Forces are the main military command in Somaliland. Along with the Somaliland Police and all other internal security forces, they are overseen by Somaliland's Ministry of Defence. The current head of Somaliland's Armed Forces is the Minister of Defence, Abdiqani Mohamoud Aateye. Following the declaration of independence, various pre-existing militia affiliated with different clans were absorbed into a centralised military structure. The resultant large military takes up around half of the country's budget, but the action served to help prevent inter-clan violence.: 2–3 
The Somaliland Army consists of twelve divisions equipped primarily with light weaponry, though it is equipped with some howitzers and mobile rocket launchers. Its armoured vehicles and tanks are mostly of Soviet design, though there are some ageing Western vehicles and tanks in its arsenal. The Somaliland Navy (often referred to as a Coast Guard by the Associated Press), despite a crippling lack of equipment and formal training, has apparently had some success at curbing both piracy and illegal fishing within Somaliland waters.


=== Human rights ===

According to the 2023 Freedom House report, Somaliland has seen a consistent erosion of political rights and civic space. Public figures and journalists face pressure from authorities. Minority clans are subject to economic and political marginalisation, and violence against women remains a serious problem.


== Administrative divisions ==

The Republic of Somaliland is divided into six administrative regions: Awdal, Sahil, Maroodi Jeeh, Togdheer, Sanaag and Sool. The regions are divided into eighteen administrative districts.


=== Regions and districts ===

The following regions are taken from Michael Walls: State Formation in Somaliland: Bringing Deliberation to Institutionalism from 2011, Somaliland: The Strains of Success from 2015 and ActionAID, a humanitarian organisation currently active in Somaliland.
In 2019, the local government law passed in 2019 (Lr. 23/2019, hereinafter referred to as the 2019 local government law), regions that "Somaliland is divided into six regions (Article 9 of the same law)". The 2019 Local Government Act came into force on 4 January 2020.
Under Article 11, Section 1 of the Act, the regional boundaries are supposed to correspond to the boundaries of the six districts under the Somaliland protectorate; however, the Siad Barre era boundaries subsist as the de facto boundaries.


== Geography ==


=== Location and habitat ===

Somaliland is situated in the northwest of recognised Somalia. It lies between 08°N and 11°30'N, and between 42°30'E and 49°00'E. It is bordered by Djibouti to the west, Ethiopia to the south, and Somalia to the east. Somaliland has an 850 kilometres (528 mi) coastline with the majority lying along the Gulf of Aden.: 1  In terms of landmass, Somaliland has an area of 176,120 km2 (68,000 sq mi).
Somaliland's climate is a mixture of wet and dry conditions. The northern part of the region is hilly, and in many places the altitude ranges between 900 and 2,100 metres (3,000 and 6,900 ft) above sea level. The Awdal, Sahil and Maroodi Jeex regions are fertile and mountainous, while Togdheer is mostly semi-desert with little fertile greenery around. The Awdal region is also known for its offshore islands, coral reefs and mangroves.
A scrub-covered, semi-desert plain referred as the Guban lies parallel to the Gulf of Aden littoral. With a width of twelve kilometres (7.5 miles) in the west to as little as two kilometres (1.2 miles) in the east, the plain is bisected by watercourses that are essentially beds of dry sand except during the rainy seasons. When the rains arrive, the Guban's low bushes and grass clumps transform into lush vegetation. This coastal strip is part of the Ethiopian xeric grasslands and shrublands ecoregion.
Cal Madow is a mountain range in the eastern part of the country. Extending from the northwest of Erigavo to several kilometres west of the city of Bosaso in neighbouring Somalia, it features Somaliland's highest peak, Shimbiris, which sits at an elevation of about 2,416 metres (7,927 ft). The rugged east–west ranges of the Karkaar Mountains also lie to the interior of the Gulf of Aden littoral. In the central regions, the northern mountain ranges give way to shallow plateaus and typically dry watercourses that are referred to locally as the Ogo. The Ogo's western plateau, in turn, gradually merges into the Haud, an important grazing area for livestock. In the east, the Haud is separated from the Ain and Nugal valleys by the Buur Dhaab mountain range.

	Landscapes of Somaliland
		
			
			
		
		
			
			
		
		
			
			
		
		
			
			
		
		
			
			
		


=== Climate ===

Somaliland is located north of the equator. It is semi-arid. The average daily temperatures range from 25 to 35 °C (77 to 95 °F). The sun passes vertically overhead twice a year, in April and in August or September. Somaliland consists of three main topographic zones: a coastal plain (Guban), the coastal range (Ogo), and a plateau (Hawd). The coastal plain is a zone with high temperatures and low rainfall. Summer temperatures in the region easily average over 100 °F (38 °C). However, temperatures come down during the winter, and both human and livestock populations increase dramatically in the region.
The coastal range (Ogo) is a high plateau to the immediate south of Guban. Its elevation ranges from 6,000 feet (1,800 m) above sea level in the West to 7,000 feet (2,100 m) in the East. Rainfall is heavier there than in Guban, although it varies considerably within the zone. The plateau (Hawd) region lies to the south of Ogo range. It is generally more heavily populated during the wet season, when surface water is available. It is also an important area for grazing. Somalilanders recognise four seasons in the year; GU and Hagaa comprise spring and summer in that order, and Dayr and Jiilaal correspond to autumn and winter, respectively.
The average annual rainfall is 446 millimetres (17.6 in) in some parts of country according to availability of rain gauge, and most of it comes during Gu and Dayr. Gu, which is the first, or major, rainy season (late March, April, May, and early June), is where Ogo range and Hawd experience the heaviest rainfall. This constitutes the period of fresh grazing and abundant surface water. It is also the breeding season for livestock. Hagaa (from late June through August) is usually dry although there are often some scattered showers in the Ogo range, these are known as Karan rains. Hagaa tends to be hot and windy in most parts of the country. Dayr (September, October, and early November), which roughly corresponds to autumn, is the second, or minor, wet season; the amount of precipitation is generally less than that of Gu. Jilaal, or winter, falls in the coolest and driest months of the year (from late November to early March). It is a season of thirst. Hawd receive virtually no rainfall in winter. The rainfall in the Guban zone, known as "Hays", comes from December to February. The humidity of the country varies from 63% in the dry season to 82% in the wet season.


=== Wildlife ===


== Economy ==

Somaliland has the fourth-lowest GDP per capita in the world, and there are huge socio-economic challenges for Somaliland, with an unemployment rate between 60 and 70% among youth, if not higher. According to ILO, illiteracy exists up to 70% in several areas of Somaliland, especially among females and the elder population.
Since Somaliland is unrecognised, international donors have found it difficult to provide aid. As a result, the government relies mainly upon tax receipts and remittances from the large Somali diaspora, which contribute significantly to the Somaliland economy. Remittances come to Somaliland through money transfer companies, the largest of which is Dahabshiil, one of the few Somali money transfer companies that conform to modern money-transfer regulations. The World Bank estimates that remittances worth approximately US$1 billion reach Somalia annually from émigrés working in the Gulf states, Europe and the United States. Analysts say that Dahabshiil may handle around two-thirds of that figure and as much as half of it reaches Somaliland alone.
Since the late 1990s, service provisions have significantly improved through limited government provisions and contributions from non-governmental organisations, religious groups, the international community (especially the diaspora), and the growing private sector. Local and municipal governments have been developing key public service provisions such as water in Hargeisa and education, electricity, and security in Berbera. In 2009, the Banque pour le Commerce et l'Industrie – Mer Rouge (BCIMR), based in Djibouti, opened a branch in Hargeisa and became the first bank in the country since the 1990 collapse of the Commercial and Savings Bank of Somalia. In 2014, Dahabshil Bank International became the country's first commercial bank. In 2017 Premier Bank from Mogadishu opened a branch in Hargeisa.


=== Monetary and payment system ===

The Somaliland shilling, which cannot easily be exchanged outside of Somaliland on account of the nation's lack of recognition, is regulated by the Bank of Somaliland, the central bank, which was established constitutionally in 1994.
The most popular and used payment system in the country is the ZAAD service, which is a mobile money transfer service that was launched in Somaliland in 2009 by the largest mobile operator Telesom.


=== Telecommunications ===

Telecommunications companies serving Somaliland include Telesom, Somtel, Telcom and NationLink.
The state-run Somaliland National TV is the main national public service television channel, and was launched in 2005. Its radio counterpart is Radio Hargeisa.


=== Agriculture ===

Livestock is the backbone of Somaliland's economy. Sheep, camels, and cattle are shipped from the Berbera port and sent to Gulf Arab countries, such as Saudi Arabia. The country is home to some of the largest livestock markets, known in Somali as seylad, in the Horn of Africa, with as many as 10,000 heads of sheep and goats sold daily in the markets of Burao and Yirowe, many of whom shipped to Gulf states via the port of Berbera. The markets handle livestock from all over the Horn of Africa.
Agriculture is generally considered to be a potentially successful industry, especially in the production of cereals and horticulture. Mining also has potential, though simple quarrying represents the extent of current operations, despite the presence of diverse quantities of mineral deposits.
The primary method of agricultural production is rain-fed farming. Cereals are the primary crops cultivated. About 70% of the rain-fed agricultural land is used for the main crop, sorghum, while maize occupies another 25% of the land. Scattered marginal lands are also used to grow other crops like barley, millet, groundnuts, beans, and cowpeas. The majority of farms are located near riverbanks, along the banks of streams (togs) and other water sources. The primary methods of channelling water from the source to the farm are floods or crude earth canals that divert perennial water (springs) to the farm. Fruits and vegetables are grown for commercial use on the majority of irrigated farms. 


=== Tourism ===

The rock art and caves at Laas Geel, situated on the outskirts of Hargeisa, are a popular local tourist attraction. Totaling ten caves, they were discovered by a French archaeological team in 2002 and are believed to date back around 5,000 years. The government and locals keep the cave paintings safe and only a restricted number of tourists are allowed entry. Other notable sights include the Freedom Arch in Hargeisa and the War Memorial in the city centre. Natural attractions are very common around the region. The Naasa Hablood are twin hills located on the outskirts of Hargeisa that Somalis in the region consider to be a majestic natural landmark.
The Ministry of Tourism has also encouraged travellers to visit historic towns and cities in Somaliland. The historic town of Sheekh is located near Berbera and is home to old British colonial buildings that have remained untouched for over forty years. Berbera also houses historic and impressive Ottoman architectural buildings. Another equally famous historic city is Zeila. Zeila was once part of the Ottoman Empire, a dependency of Yemen and Egypt and a major trade city during the 19th century. The city has been visited for its old colonial landmarks, offshore mangroves and coral reefs, towering cliffs, and beach. The nomadic culture of Somaliland has also attracted tourists. Most nomads live in the countryside.


=== Transport ===

Bus services operate in Hargeisa, Burao, Gabiley, Berbera and Borama. There are also road transportation services between the major towns and adjacent villages, which are operated by different types of vehicles. Among these are taxis, four-wheel drives, minibuses and light goods vehicles (LGV).
The most prominent airlines serving Somaliland is Daallo Airlines, a Somali-owned private carrier with regular international flights that emerged after Somali Airlines ceased operations. African Express Airways and Ethiopian Airlines also fly from airports in Somaliland to Djibouti City, Addis Ababa, Dubai and Jeddah, and offer flights for the Hajj and Umrah pilgrimages via the Egal International Airport in Hargeisa. Other major airports in the region include the Berbera Airport.


=== Ports ===

In June 2016, the Somaliland government signed an agreement with DP World to manage the strategic port of Berbera with the aim of enhancing productive capacity and acting as an alternative port for landlocked Ethiopia.


=== Oil exploration ===
In 1958, the first test well was dug by Standard Vacuum (Exxon Mobil and Shell) in Dhagax Shabeel, Saaxil region. These wells were selected without field data or seismic testing and were solely based on the geological makeup of the region. Three of the four test wells were successful in producing of light crude oil.
In August 2012, the Somaliland government awarded Genel Energy a licence to explore oil within its territory. Results of a surface seep study completed early in 2015 confirmed the outstanding potential offered in the SL-10B, SL-13, and Oodweyne blocks, with estimated oil reserves of 1 billion barrels each. Genel Energy is set to drill an exploration well for SL-10B and SL-13 block in Buur-Dhaab, 20 kilometres northwest of Aynaba by the end of 2018. In December 2021, Genel Energy signed a farm-out deal with OPIC Somaliland Corporation, backed by Taiwan's CPC Corporation, on the SL10B/13 block neary Aynaba. According to Genel, the block could contain more than 5 billion barrels of prospective resources. Drilling in SL-10B and SL-13 is scheduled to begin in late 2023, or early 2024 according to Genel.


== Demographics ==

There has not been an official census conducted in Somaliland since the Somalia census in 1975, while the results from a 1986 census were never released into public domain. A population estimate was conducted by UNFPA in 2014 primarily for the purpose of distributing United Nations funding among the regions and to offer a reliable population estimate in lieu of a census. This population estimate puts the combined population of the regions of Somaliland at 3.5 million. The Somaliland government estimates that there are 6,200,000 residents as of 2024, an increase from a 2021 government estimate of 5,700,000.
The last British population estimate on the basis of clan in Somaliland occurred before independence in 1960, according to which, out of some 650,000 ethnic Somalis belonging to three major clans residing in the protectorate, the Isaaq, Darod and Dir made up 66%, 19% and 16% of the population, respectively.

The largest clan family in Somaliland is the Isaaq, currently making up 80% of Somaliland's population. The populations of the five largest cities in Somaliland – Hargeisa, Burao, Berbera, Erigavo and Gabiley – are predominantly Isaaq. The second largest clan is the Gadabursi of the Dir clan followed by the Harti of the Darod. Other small clans are often not accounted for in such estimates, however, clans including Gabooye, Gahayle, Jibrahil, Magaadle, Fiqishini, and Akisho settle in Somaliland.
Somaliland in addition has an estimated 600,000 to a million strong diaspora, mainly residing in Western Europe, the Middle East, North America, and several other African countries.


=== Clan groups ===

The Gadabursi subclan of the Dir are the predominant clan of the Awdal region, where there is also a sizeable minority of the Issa subclan of the Dir who mainly inhabit the Zeila District.
The Habr Awal subclan of the Isaaq form the majority of the population living in both the northern and western portions of the Maroodi Jeex region, including the cities and towns of northern Hargeisa, Berbera, Gabiley, Madheera, Wajaale, Arabsiyo, Bulhar and Kalabaydh. The Habr Awal also have a strong presence in the Saaxil region as well, principally around the city of Berbera and the town of Sheikh.
The Arap subclan of the Isaaq predominantly live in the southern portion of the Maroodi Jeex region including the capital city of Hargeisa. Additionally, they form the majority of communities living in the Hawd region including Baligubadle. The Arap are also well represented in Sahil and Togdheer regions.
The Garhajis subclan of the Isaaq have a sizeable presence among the population inhabiting the southern and eastern portions of Maroodi Jeex region including Southern Hargeisa and Salahlay. The Garhajis are also represented well in western Togdheer region, mainly in Oodweyne and Burao, as well as Sheekh and Berbera in Sahil region. The Garhajis also have a significant presence in the western and central areas of Sanaag region as well, including the regional capital Erigavo as well as Maydh.
The Habr Je'lo subclan of the Isaaq have a large presence in the western parts of Sool, eastern Togdheer region and western Sanaag as well, The Habr Je'lo form a majority of the population living in Burao as well as in the Togdheer region, western Sanaag, including the towns of Garadag, Xiis and Ceel Afweyn and the Aynabo District in Sool. The clan also has a significant presence in the Sahil region, particularly in the towns of Karin and El-Darad, and also inhabit the regional capital Berbera.

Eastern Sool region residents mainly hail from the Dhulbahante, a subdivision of the Harti confederation of Darod sub-clans, and are concentrated at majority of Sool region districts. The Dhulbahante clans also settle in the Buuhoodle District in the Togdheer region, and the southern and eastern parts of Erigavo District in Sanaag.
The Warsangali, another Harti Darod sub-clan, live in the eastern parts of Sanaag, with their population being mainly concentrated in Las Qorey district.


=== Languages ===

Many people in Somaliland speak at least two of the three national languages: Somali, Arabic and English, although the rate of bilingualism is lower in rural areas. Article 6 of the Constitution of 2001 designates the official language of Somaliland to be Somali, though Arabic is a mandatory subject in school and is used in mosques around the region and English is spoken and taught in schools.
The Somali language is the mother tongue of the Somali people, the nation's most populous ethnic group. It is a member of the Cushitic branch of the Afro-Asiatic language family, and its nearest relatives are the Oromo, Afar and Saho languages. Somali is the best documented of the Cushitic languages, with academic studies of it dating from before 1900.
Northern Somali is the main dialect spoken in the country, in contrast to Benadiri Somali which is the main dialect spoken in Somalia.


=== Religion ===

With few exceptions, Somalis in Somaliland and elsewhere are Muslims, the majority belonging to the Sunni branch of Islam and the Shafi'i school of Islamic jurisprudence. As with southern Somali coastal towns such as Mogadishu and Merca, there is also a presence of Sufism, Islamic mysticism; particularly the Arab Rifa'iya tariiqa. Through the influence of the diaspora from Yemen and the Gulf states, stricter Wahhabism also has a noticeable presence. Though traces of pre-Islamic traditional religion exist in Somaliland, Islam is dominant to the Somali sense of national identity. Many of the Somali social norms come from their religion. For example, most Somali women wear a hijab when they are in public. In addition, religious Somalis abstain from pork and alcohol, and also try to avoid receiving or paying any form of interest (usury). Muslims generally congregate on Friday afternoons for a sermon and group prayer.
Under the Constitution of Somaliland, Islam is the state religion, and no laws may violate the principles of Sharia. The promotion of any religion other than Islam is illegal, and the state promotes Islamic tenets and discourages behaviour contrary to Islamic morals.
Somaliland has very few Christians. In 1913, during the early part of the colonial era, there were virtually no Christians in the Somali territories, with about 100–200 followers coming from the schools and orphanages of the handful of Catholic missions in the British Somaliland protectorate. The small number of Christians in the region today mostly come from similar Catholic institutions in Aden, Djibouti, and Berbera.
Somaliland falls within the Episcopal Area of the Horn of Africa as part of Somalia, under the Anglican Diocese of Egypt. However, there are no current congregations in the territory. The Roman Catholic Diocese of Mogadiscio is designated to serve the area as part of Somalia. However, since 1990 there has been no Bishop of Mogadishu, and the Bishop of Djibouti acts as Apostolic Administrator. The Adventist Mission also indicates that there are no Adventist members.


=== Health ===

While 40.5% of households in Somaliland have access to improved water sources, almost a third of households lie at least an hour away from their primary source of drinking water. 1 in 11 children die before their first birthday, and 1 in 9 die before their fifth birthday.
The UNICEF multiple indicator cluster survey (MICS) in 2006 found that 94.8% of women in Somaliland had undergone some form of female genital mutilation; in 2018 the Somaliland government issued a fatwa condemning the two most severe forms of FGM, but no laws are present to punish those responsible for the practice.


=== Education ===

Somaliland has an urban literacy rate of 59% and a rural literacy rate of 47%, according to a 2015 World Bank assessment.


== Culture ==

The main clans of Somaliland: Isaaq (Garhajis, Habr Je'lo, Habr Awal, Arap, Ayub), Harti (Dhulbahante, Warsangali, Kaskiqabe, Gahayle), Dir (Gadabuursi, Issa, Magaadle) and Madhiban. Other smaller clans include: Jibraahil, Akisho, and others.
The clan groupings of the Somali people are important social units, and have a central role in Somali culture and politics. Clans are patrilineal and are often divided into sub-clans, sometimes with many sub-divisions.
Somali society is traditionally ethnically endogamous. To extend ties of alliance, marriage is often to another ethnic Somali from a different clan. Thus, for example, a 1954 study observed that in 89 marriages contracted by men of the Dhulbahante clan, 55 (62%) were with women of Dhulbahante sub-clans other than those of their husbands; 30 (33.7%) were with women of surrounding clans of other clan families (Isaaq, 28; Hawiye, 3); and 3 (4.3%) were with women of other clans of the Darod clan family (Majerteen 2, Ogaden 1).


=== Arts ===

Islam and poetry have been described as the twin pillars of Somali culture. Somali poetry is mainly oral, with both male and female poets. They use things that are common in the Somali language as metaphors. Almost all Somalis are Sunni Muslims and Islam is vitally important to the Somali sense of national identity. Most Somalis do not belong to a specific mosque or sect and can pray in any mosque they find.
Celebrations come in the form of religious festivities. Two of the most important are Eid ul-Adha and Eid ul-Fitr, which marks the end of the fasting month. Families get dressed up to visit one another, and money is donated to the poor. Other holidays include 26 June and 18 May, which celebrate British Somaliland's independence and the Somaliland region's establishment, respectively; the latter, however, is not recognised by the international community.

In the nomadic culture, where one's possessions are frequently moved, there is little reason for the plastic arts to be highly developed. Somalis embellish and decorate their woven and wooden milk jugs (haamo; the most decorative jugs are made in Ceerigaabo) as well as wooden headrests. Traditional dance is also important, though mainly as a form of courtship among young people. One such dance known as Ciyaar Soomaali is a local favourite.
An important form of art in Somali culture is henna art. The custom of applying henna dates back to antiquity. During special occasions, a Somali woman's hands and feet are expected to be covered in decorative mendhi. Girls and women usually apply or decorate their hands and feet in henna on festive celebrations like Eid or weddings. The henna designs vary from very simple to highly intricate. Somali designs vary, with some more modern and simple while others are traditional and intricate. Traditionally, only women apply it as body art, as it is considered a feminine custom. Henna is not only applied on the hands and feet but is also used as a dye. Somali men and women alike use henna as a dye to change their hair colour. Women are free to apply henna on their hair as most of the time they are wearing a hijab.


=== Sport ===

Popular sports in Somaliland include football, track, field, and basketball. Somaliland has a national football team, though it is not a member of FIFA or the Confederation of African Football.


== See also ==

Index of Somaliland-related articles
List of Somalilanders
Outline of Somaliland


== Notes ==


== References ==


== Bibliography ==
Hoehne, Markus V. 2009: Mimesis and mimicry in dynamics of state and identity formation in northern Somalia, Africa 79/2, pp. 252–281.
Hoehne, Markus V. 2007: Puntland and Somaliland clashing in northern Somalia: Who cuts the Gordian knot?, published online on 7 November 2007.
"As Somalia Struggles, Can Neighboring Somaliland Become East Africa's Next Big Commercial Hub?". International Business Times. 18 September 2013. Retrieved 23 April 2019.
Warmington, Eric Herbert (1995). The Commerce Between the Roman Empire and India. South Asia Books. ISBN 81-215-0670-0.
Bradbury, Mark, Becoming Somaliland (James Currey, 2008)
Michael Schoiswohl: Status and (Human Rights) Obligations of Non-Recognized De Facto Regimes in International Law: The Case of 'Somaliland' (Martinus Nijhoff, Leiden 2004), ISBN 90-04-13655-X
Richards, Rebecca (2014). Understanding Statebuilding: Traditional Governance and the Modern State in Somaliland. Surrey: Ashgate. ISBN 978-1-4724-2589-8.


== External links ==

 Wikimedia Atlas of Somaliland
Somaliland web resources provided by GovPubs at the University of Colorado Boulder Libraries
Government of Somaliland (official website)
Somaliland – BBC Country Profile
Update on the Situation in the Somaliland (archived version)"}}}}